In [35]:
'''
There Are Three Source because of that values are missings always.
A. Missing value completely Random.(Values are Missings randomly)
B. Missing value Random.(One Variable is Depend on another variable but still we won't get clarity how it will effect on my predictions)
C. Missing Values at random. (When there is a reason behind for missing values.)
'''

"\nThere Are Three Source because of that values are missings always.\nA. Missing value completely Random.(Values are Missings randomly)\nB. Missing value Random.(One Variable is Depend on another variable but still we won't get clarity how it will effect on my predictions)\nC. Missing Values at random. (When there is a reason behind for missing values.)\n"

In [36]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [37]:
pd.set_option('display.max_columns',None)

In [38]:
data = pd.read_csv("train.csv")

In [39]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [41]:
data.isnull().mean()

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [42]:
#In Percentage we will talk then in cabin approximatly 77 percent data is missing right now.
#For Age 20 Percent data is missings.

In [43]:
#Assumption -1. A data is missing because if a person is not survived so we will enable to ask info about cabin and age.

In [44]:
#missing data Not as Random
data['cabin_null'] = np.where(data.Cabin.isnull(),1,0)

In [45]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_null
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [46]:
data.cabin_null.mean()     #77 Percent data in missing in this Columnsa

0.7710437710437711

In [47]:
x  = data.groupby('Survived')

In [48]:
data1 = x.get_group(0)

In [49]:
data1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_null
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,1
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,0
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,1

In [50]:
data2 = x.get_group(1)

In [51]:
data1['cabin_null'].mean()

0.8761384335154827

In [52]:
data2['cabin_null'].mean()

0.6023391812865497

In [53]:
'''
Conclusion -
Totally cabin in whole dataset 80 percent data is missing.and in this data people who won't surive we are unable to featch the information so dtaa
is missing.Comparision to people they survived.
'''

"\nConclusion -\nTotally cabin in whole dataset 80 percent data is missing.and in this data people who won't surive we are unable to featch the information so dtaa\nis missing.Comparision to people they survived.\n"

In [54]:
#Shortcut Methods-
data.groupby(['Survived'])['cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: cabin_null, dtype: float64

In [55]:
#For Age 20 Percent data is Missing.

In [56]:
data['Age_null'] = np.where(data.Age.isnull(),1,0)

In [57]:
data.groupby('Survived')['Age_null'].mean()

Survived
0    0.227687
1    0.152047
Name: Age_null, dtype: float64

In [58]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_null,Age_null
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1,0

In [ ]:
#Beacuse a person won't survive we don't have values.

In [59]:
#Missing Values as Completly at random
data[data.Embarked.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_null,Age_null
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN,0,0
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN,0,0

In [ ]:
#Missing Value at Random(Depend On The Another Variable)

In [60]:
data=pd.read_csv('loan.csv', usecols=['emp_title','emp_length'])
data.head()

        emp_title emp_length
0            Chef  10+ years
1     Postmaster   10+ years
2  Administrative    6 years
3   IT Supervisor  10+ years
4        Mechanic  10+ years

In [61]:
data.isnull().mean()

emp_title     0.073858
emp_length    0.064984
dtype: float64

In [62]:
len(data.emp_title.unique())

512695

In [63]:
data.emp_length.unique()

array(['10+ years', '6 years', '4 years', '< 1 year', '2 years',
       '9 years', nan, '5 years', '3 years', '7 years', '1 year',
       '8 years'], dtype=object)

In [65]:
data.emp_length.value_counts()

10+ years    748005
2 years      203677
< 1 year     189988
3 years      180753
1 year       148403
5 years      139698
4 years      136605
6 years      102628
7 years       92695
8 years       91914
9 years       79395
Name: emp_length, dtype: int64

In [ ]:
#Write Now I Am Living This Section but in future i will come back and Complete The Section.